doc/main.dot
digraph G {
	Start -> DeviceDiscovery [ label = "startScan(AdvertisementCB)" ];
	DeviceDiscovery -> Connecting [ label = "AdvertisementCB() [Addr==0xf4]" ];
	Connecting -> Connected [ label = "ConnectionCB() [role==Gap::CENTRAL]" ];
	Connected -> ServiceCharacteristicsDiscovery [ label = "launchServiceDiscovery()" ];
	Connected -> ServiceDiscovery [ label = "launchServiceDiscovery()" ];
	ServiceDiscovery -> ServiceDiscovery [ label = "ServiceDiscoveryCB()" ];
	ServiceCharacteristicsDiscovery -> ServiceCharacteristicsDiscovery [ label = "ServiceCharacteristicsCB() [UUID==0x2A5B]" ];
	Connected -> DiscoverCharacteristicDescriptors [ label = "ServiceDiscoveryTerminationCB()" ];
	DiscoverCharacteristicDescriptors -> DiscoverCharacteristicDescriptors [ label = "DiscoveredDescCB() [UUID==0x2902]" ];
	DiscoverCharacteristicDescriptors -> FoundCharacteristicDescriptors [ label = "DiscoveredDescTerminationCB()" ];

	FoundCharacteristicDescriptors -> Running [ label = "write(BLE_HVX_NOTIFICATION)" ];
	Running -> Running [ label = "Read()" ];

	Start [shape=Mdiamond];
	Running [shape=Msquare];
}
